<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use App\Models\Category;
use App\Models\Service;
use App\Models\Tag;
use App\Models\User;
use Carbon\Carbon;
use Carbon\Traits\Timestamp;
use Database\Factories\ServiceFactory;
use DateTime;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {

//        ServiceFactory::factory()->create();


        \App\Models\User::create([
            'name' => 'Alex',
            'email' => 'savchuk.aviz@gmail.com',
            'password' => Hash::make('ChesterSlim1423'),
            'role' => '1',
            'email_verified_at' => Carbon::now()
        ]);

        Category::create([
           'name' => 'Текст',
           'slug' => 'text' ,
        ]);


        Category::create([
            'name' => 'Картинка',
            'slug' => 'image' ,
        ]);

        Tag::create([
            'name' => 'Дизайн',
            'slug' => 'diayn' ,
        ]);

        Service::create([
            'title' => 'ChatGPT',
            'slug' => 'chatgpt',
            'developer' => 'ChatGPT',
            'release_date' => '2021',
            'logo' => 'public/image/YvnYJ4fxyolYaM8sEEeEg50Ahhr5LU5hghpq1Yvk.png',
            'image' => 'public/image/dsC2jZKRwWtkZdUvz2teIJ1zfg1d8N4zLhPAPnsm.jpg',
            'link_to_service' => 'https://chat.openai.com',
            'category_id' => '1',
            'excerpt' => 'Універсальний помічник у вирішенні будь-яких завдань',
            'main_content' => "<p>З появою технології штучного інтелекту (ШІ), можливості людини значно розширилися. Одним з інтелектуальних помічників, створених на базі передової технології, є ChatGPT. Цей інтелектуальний помічник здатен вирішувати найрізноманітніші завдання, незалежно від їх складності та тематики.</p>
                                <p>Однією з переваг ChatGPT є його універсальність. Він може працювати з багатьма мовами та допомагати у різних сферах: від написання текстів для веб-сайтів та відповідей на електронні листи до перекладу тексту на іншу мову та проведення досліджень.</p>
                                <p>Завдяки своїй здатності до навчання, ChatGPT постійно удосконалює свої навички та можливості. Він швидко засвоює нову інформацію та здатний аналізувати великі обсяги даних, що дозволяє ефективно вирішувати завдання в будь-якій галузі.</p>
                                <p>Ще однією перевагою ChatGPT є його доступність. Ви можете скористатися послугами цього інтелектуального помічника в будь-який час та в будь-якому місці, де є доступ до Інтернету.</p>
                                <p>Використання ChatGPT дозволяє значно зекономити час та зусилля, а також забезпечує якість та точність вирішення завдань. З ним ви зможете зосередитися на головних справах та дійсно ефективно використовувати свій час.</p>
                                <p>Якщо вам потрібна допомога у вирішенні будь-яких завдань, спробуйте скористатися послугами ChatGPT. Він з радістю допоможе вам у будь-який&nbsp;</p>
                                <p>випадок та забезпечить якісне та швидке виконання завдань.</p>
                                <p>Крім того, використання ChatGPT є вигідним із фінансової точки зору. Ви зможете отримати високоякісні послуги за доступну ціну, що дозволить зберегти витрати на найм фахівців у певній галузі.</p>
                                <p>Високі результати використання ChatGPT забезпечуються його інтелектуальним потенціалом та здатністю швидко навчатися. Він здатний розпізнавати та аналізувати великі обсяги інформації, що дозволяє вирішувати завдання в будь-якій галузі.</p>
                                <p>Не витрачайте свій час та зусилля на вирішення завдань самостійно. Скористайтеся послугами ChatGPT та отримайте високоякісну та швидку допомогу у вирішенні будь-яких завдань. Дійте прямо зараз та отримайте більше вільного часу та можливостей для розвитку.</p>",
            'is_published' => '1',
        ]);

        Service::create([
            'title' => 'Copy.ai',
            'slug' => 'copyai',
            'developer' => 'Copy.ai',
            'release_date' => '2020',
            'logo' => 'public/image/4QPNkiiSkNkre1AblrYzfHl0YRFPYYRzOEf8vhD6.svg',
            'image' => 'public/image/D0pBrf93ccXNZI8yuIhLkwJuXS0IKGu0RvFEoYSp.png',
            'link_to_service' => 'https://www.copy.ai',
            'category_id' => '1',
            'excerpt' => 'Ефективний та інноваційний інструмент для створення контенту',
            'main_content' => "<p>Copy.ai - інноваційний сервіс, що допомагає власникам бізнесу, маркетологам та контент-менеджерам створювати контент за допомогою штучного інтелекту. Цей сервіс дає можливість створювати унікальний контент швидко та легко, що значно зекономить час та кошти.</p>
                                <p>Однією з головних переваг Copy.ai є його широкий функціонал. Сервіс дає можливість створювати контент для різних потреб, від створення заголовків до описів продуктів. Крім того, Copy.ai вміє адаптуватися до потреб користувача, враховуючи його стиль та тон голосу.</p>
                                <p>Також слід зазначити, що Copy.ai є досить простим та зручним у використанні. Користувачу не потрібно мати спеціальних знань чи навичок для роботи з сервісом. Все, що потрібно - це ввести ключові слова та натиснути кнопку, щоб отримати унікальний контент.</p>
                                <p>Один з найбільших результатів від використання Copy.ai - це економія часу. Створення унікального контенту є досить часоємним процесом, але з Copy.ai все значно простіше та швидше. Крім того, використання сервісу дозволяє власникам бізнесу та маркетологам зосередитися на інших важливих аспектах своєї роботи, що може допомогти покращити результати бізнесу.</p>
                                <p>Також слід зазначити, що Copy.ai є досить економічним сервісом. Вартість використання сервісу є досить низькою порівняно з тим, що користувач отримує в результаті.</p>
                                <p>Отже, Copy.ai - це інноваційний та зручний сервіс, який допоможе створювати унікальний та якісний контент.</p>",
            'is_published' => '1',
        ]);

        Service::create([
            'title' => 'MidJourney',
            'slug' => 'midjourney',
            'developer' => 'MidJourney',
            'release_date' => '2021',
            'logo' => 'public/image/zwifi9ZCJmXAn23tQ6aPh36SpDQZNd67sOUebwVD.png',
            'image' => 'public/image/TUJUqoTSv0O9ivy6zscWtT5S9oOZC1rVweBOoqlB.png',
            'link_to_service' => 'https://midjourney.com/',
            'category_id' => '2',
            'excerpt' => 'Сервіс, який дозволяє користувачам генерувати креативні та якісні зображення з текстового опису.',
            'main_content' => "<p>MidJourney - це унікальний сервіс, який може бути корисним для різних категорій користувачів, включаючи бізнес-власників, маркетологів, соціальних медіа менеджерів, дизайнерів та простих користувачів. Сервіс дозволяє створювати високоякісні зображення з текстового опису всього за кілька хвилин, зменшуючи витрати на зовнішніх графічних дизайнерів або засоби для створення зображень.</p>
<p>Однією з найбільших переваг MidJourney є те, що користувачам не потрібно мати великого досвіду у графічному дизайні, щоб створювати професійні зображення. Сервіс автоматично створює зображення на основі текстового опису, який надає користувач. Крім того, MidJourney має велику бібліотеку готових зображень та іконок, які можна використовувати для створення своїх зображень.</p>
<p>Одним з ключових елементів, який робить MidJourney таким корисним для бізнесу, є можливість швидко створювати зображення для продуктів або рекламних матеріалів. Бізнеси можуть використовувати MidJourney для створення зображень для своїх продуктів, що допомагає збільшити привабливість товару на електронних платформах, таких як інтернет-магазини.</p>
<p>Соціальні медіа менеджери також можуть скористатися MidJourney, щоб створювати креативні зображення для своїх соціальних медіа кампаній. Сервіс надає можливість додавати фон, текст та графічні елементи, щоб створювати цікаві та естетичні зображення для соціальних мереж.</p>
<p>Дизайнери можуть використовувати MidJourney як інструмент для створення макетів та концептів, що можуть допомогти в роботі над проектами. Завдяки більшості інструментів, які містяться в сервісі, дизайнерам не потрібно витрачати багато часу на створення базових елементів дизайну, таких як іконки, фони або текстові блоки.</p>
<div>
<div>
<div>
<div>
<div>
<div>
<p>MidJourney також може бути корисним для простих користувачів, які потребують створити зображення для блогу, презентації або для особистого використання. Сервіс надає можливість створювати зображення будь-якої тематики, що робить його універсальним інструментом для створення графіки будь-якого типу.</p>
<p>Крім того, MidJourney має простий та інтуїтивно зрозумілий інтерфейс, що дозволяє користувачам швидко зрозуміти, як використовувати сервіс. Користувачі можуть вибирати з різних шаблонів та налаштувати їх згідно зі своїми потребами, щоб створювати унікальні зображення.</p>
<p>Загалом, MidJourney - це потужний інструмент для створення зображень з тексту, який може бути корисним для різних категорій користувачів. Цей сервіс дозволяє створювати професійні та привабливі зображення в мить часу, що допомагає зменшити витрати на зовнішніх графічних дизайнерів та інші засоби для створення зображень.</p>
</div>
</div>
</div>
<div>&nbsp;</div>
</div>
</div>
</div>",
            'is_published' => '1',
        ]);



    }
}
